Checked on provider version 0.1.3 - terraform 0.14.4
Used the below configuration:
```
resource "intersight_os_install" "os1" {
  name = "InstallTemplatee165"
  server {
    object_type = "compute.RackUnit"
    moid = "1234567890"
  }
  image {
    object_type = "softwarerepository.OperatingSystemFile"
    moid = "1234567890"
  }
  osdu_image {
    moid = "1234567890"
    object_type = "firmware.ServerConfigurationUtilityDistributable"
  }
  answers {
    answer_file = "Lorem ipsum dolor sit amet, consectetaur adipisicing elit, sed do eiusmod tempo"
    nr_source = "File"
  }
  description = "Install Template 5"
  install_method = "vMedia"
  organization {
    object_type = "organization.Organization"
    moid = "1234567890"
  }
}
```
`terraform apply` is not throwing error:
```
  # intersight_os_install.os1 will be created
  + resource "intersight_os_install" "os1" {
      + additional_parameters       = (known after apply)
      + answers                     = [
          + {
              + additional_properties    = null
              + answer_file              = "dsafghjkljhgfdsadfghjkljhgfds"
              + class_id                 = (known after apply)
              + hostname                 = null
              + ip_config_type           = "static"
              + ip_configuration         = (known after apply)
              + is_answer_file_set       = (known after apply)
              + is_root_password_crypted = null
              + is_root_password_set     = (known after apply)
              + nameserver               = null
              + nr_source                = "File"
              + object_type              = (known after apply)
              + product_key              = null
              + root_password            = null
            },
        ]
      + class_id                    = (known after apply)
      + configuration_file          = (known after apply)
      + description                 = "Install Template 5"
      + id                          = (known after apply)
      + image                       = [
          + {
              + additional_properties = null
              + class_id              = (known after apply)
              + moid                  = "1234567890"
              + object_type           = "softwarerepository.OperatingSystemFile"
              + selector              = (known after apply)
            },
        ]
      + install_method              = "vMedia"
      + install_target              = (known after apply)
      + moid                        = (known after apply)
      + name                        = "InstallTemplatee165"
      + object_type                 = (known after apply)
      + operating_system_parameters = (known after apply)
      + organization                = [
          + {
              + additional_properties = null
              + class_id              = (known after apply)
              + moid                  = "1234567890"
              + object_type           = "organization.Organization"
              + selector              = (known after apply)
            },
        ]
      + osdu_image                  = [
          + {
              + additional_properties = null
              + class_id              = (known after apply)
              + moid                  = "1234567890"
              + object_type           = "firmware.ServerConfigurationUtilityDistributable"
              + selector              = (known after apply)
            },
        ]
      + server                      = [
          + {
              + additional_properties = null
              + class_id              = (known after apply)
              + moid                  = "1234567890"
              + object_type           = "compute.RackUnit"
              + selector              = (known after apply)
            },
        ]
      + workflow_info               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

If you still facing the error, please provide more details like provider version and tf configuration used. 